Autodesk.Revit.DB.OpenConflictScenario
Since:
2019
The kinds of conflicts happened during open.
Since:
2019

Autodesk.Revit.DB.OpenConflictScenario.OutOfDate
Model is out of date.

Autodesk.Revit.DB.OpenConflictScenario.Relinquished
Ownership to model elements is relinquished.

Autodesk.Revit.DB.OpenConflictScenario.Rollback
Central model is restored to an earlier version.